{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 23], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution1d_1", "class_name": "Convolution1D", "config": {"name": "convolution1d_1", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution1d_11", "class_name": "Convolution1D", "config": {"name": "convolution1d_11", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_11", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_11", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"name": "convolution1d_2", "class_name": "Convolution1D", "config": {"name": "convolution1d_2", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "convolution1d_12", "class_name": "Convolution1D", "config": {"name": "convolution1d_12", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_12", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_12", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]]}, {"name": "convolution1d_3", "class_name": "Convolution1D", "config": {"name": "convolution1d_3", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "convolution1d_13", "class_name": "Convolution1D", "config": {"name": "convolution1d_13", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_3", 0, 0]]]}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_13", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_13", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"name": "convolution1d_4", "class_name": "Convolution1D", "config": {"name": "convolution1d_4", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "convolution1d_14", "class_name": "Convolution1D", "config": {"name": "convolution1d_14", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_4", 0, 0]]]}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_14", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_14", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"name": "convolution1d_5", "class_name": "Convolution1D", "config": {"name": "convolution1d_5", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "convolution1d_15", "class_name": "Convolution1D", "config": {"name": "convolution1d_15", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_5", 0, 0]]]}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_15", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_15", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]]}, {"name": "convolution1d_6", "class_name": "Convolution1D", "config": {"name": "convolution1d_6", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "convolution1d_16", "class_name": "Convolution1D", "config": {"name": "convolution1d_16", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_6", 0, 0]]]}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_16", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_16", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"name": "convolution1d_7", "class_name": "Convolution1D", "config": {"name": "convolution1d_7", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "convolution1d_17", "class_name": "Convolution1D", "config": {"name": "convolution1d_17", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_16", 0, 0]]]}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_7", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_7", 0, 0]]]}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_17", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_17", 0, 0]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"name": "convolution1d_8", "class_name": "Convolution1D", "config": {"name": "convolution1d_8", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "convolution1d_18", "class_name": "Convolution1D", "config": {"name": "convolution1d_18", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_17", 0, 0]]]}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_8", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_8", 0, 0]]]}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_18", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_18", 0, 0]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_18", 0, 0]]]}, {"name": "convolution1d_9", "class_name": "Convolution1D", "config": {"name": "convolution1d_9", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "convolution1d_19", "class_name": "Convolution1D", "config": {"name": "convolution1d_19", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_18", 0, 0]]]}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_9", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_9", 0, 0]]]}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_19", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_19", 0, 0]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_19", 0, 0]]]}, {"name": "convolution1d_10", "class_name": "Convolution1D", "config": {"name": "convolution1d_10", "trainable": true, "nb_filter": 10, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"name": "convolution1d_20", "class_name": "Convolution1D", "config": {"name": "convolution1d_20", "trainable": true, "nb_filter": 10, "filter_length": 10, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_10", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_10", 0, 0]]]}, {"name": "batchnormalization_20", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_20", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_20", 0, 0]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_20", 0, 0]]]}, {"name": "k_max_pooling1d_1", "class_name": "K_max_pooling1d", "config": {"name": "k_max_pooling1d_1", "trainable": true, "ktop": 30}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "k_max_pooling1d_2", "class_name": "K_max_pooling1d", "config": {"name": "k_max_pooling1d_2", "trainable": true, "ktop": 30}, "inbound_nodes": [[["activation_20", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["k_max_pooling1d_1", 0, 0]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["k_max_pooling1d_2", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 500, "init": "he_normal", "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": {"name": "MaxNorm", "m": 3, "axis": 0}, "b_constraint": null, "bias": true, "input_dim": 600}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "output_dim": 420, "init": "he_normal", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 500}, "inbound_nodes": [[["dropout_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "1.2.2"}